import telebot
import MAT
from telebot import types
import sqlite3
import requests

# Здесь нужно указать токен вашего Telegram-бота
bot = telebot.TeleBot('6515033748:AAGmsu4w8PH6rs10KxtMLJp1c3aKvwgb6ek')


@bot.message_handler(commands=['start'])
def xaxa(message):

    for _ in range(14):
        bot.send_message(message.chat.id, "АХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХАХААХАХАХАХАХ")


#/ban
@bot.message_handler(commands=['ban'])
def ban_user(message):
    if not message.reply_to_message:
        bot.send_message(message.chat.id,"Эта команда должна быть ответом на сообщение!" )
        return
    bot.ban_chat_member(message.chat.id, message.reply_to_message.from_user.id)


#/kill
@bot.message_handler(commands=['kill'])
def ban_user(message):
    if not message.reply_to_message:
        bot.send_message(message.chat.id, "Эта команда должна быть ответом на сообщение!")
        return
    bot.ban_chat_member(message.chat.id, message.reply_to_message.from_user.id)
    bot.unban_chat_member(message.chat.id, message.reply_to_message.from_user.id)

# Обработчик команды /set_avatar
@bot.message_handler(commands=['set_avatar'])
def set_avatar(message):
    # Проверка, что сообщение содержит фото
    if message.photo:
        # Получение идентификатора фото
        photo_id = message.photo[-1].file_id
        # Получение информации о файле фото
        file_info = bot.get_file(photo_id)
        file_path = file_info.file_path
        # Загрузка фото с использованием URL и сохранение его на сервере
        photo_url = f"https://api.telegram.org/file/bot6515033748:AAGmsu4w8PH6rs10KxtMLJp1c3aKvwgb6ek/{file_path}"
        response = requests.get(photo_url)
        if response.status_code == 200:
            with open("avatar.jpg", 'wb') as f:
                f.write(response.content)
            # Обновление аватарки группы
            with open("avatar.jpg", 'rb') as f:
                bot.set_chat_photo(message.chat.id, f)
            # Отправка ответного сообщения
            bot.send_message(message.chat.id, "Аватарка успешно изменена!")
    else:
        bot.send_message(message.chat.id, "Пожалуйста, отправьте фото.")


# Обработчик команды /set_group_name
@bot.message_handler(commands=['set_group_name'])
def set_group_name(message):
    # Проверка, что сообщение отправлено в группу
    # Получение нового названия группы
    new_name = message.text.replace("/set_group_name ", "")
    # Обновление названия группы
    bot.set_chat_title(message.chat.id, new_name)
    # Отправка ответного сообщения
    bot.send_message(message.chat.id, "Название группы успешно изменено!")


#антиМАТЫ
@bot.message_handler()
def mats(message):
    for mut in MAT.mat:
        if mut.lower() in message.text.lower():
            bot.delete_message(message.chat.id, message.id)









bot.polling(non_stop=True)